# DBMS: Database Management System

Whenever different tables are present and all these tables are logically related to each other and placed in one place it is called database.

And the creation management maintainance and update of database is known as database management system.

DBMS is of two types

(i) Relational DBMS : Works with table like database
    
                        ex: MS SQL Server(Proprietor)
            
                            Oracle(Proprietor)
                
                            SQLite/MySQL(Free and opensource)
                    
                            PostgreSQL (Free and opensource)
                        
                            
(ii)Non-Relational DBMS : Works with non tabular form of data like datas extracted from twitter, instagram etc.
    
                          Also known as No-SQL
        
                            ex: Cassandra 
                
                                AmazonDB
                    
                                MangoDB

### SQL: Structured Query Language
    
With the help of SQL the end user will be albe to interact with the tables created inside the DBMS

SQL is of 3 types:
    
    (i)DDL: Data Definition Language :- Create,ALter,Drop are the basic commands used for creation of table.
            
    (ii)DML: Data Manupulation Language :- Select,Update,Detele are the basic commands used for making changes in table.
            
    (iii)DCL: Data Control Language :- Commit,Grant,Revoke,Rollback are used to control the database.
            
            
SQL QUERIES ARE NOT CASE SENSITIVE
BUT PYTHON IS CASE SENSITIVE

In [9]:
import sqlite3

In [10]:
dbcon=sqlite3.connect('student_database')

In [11]:
cur=dbcon.cursor()

In [13]:
cur.execute('create table student(id int primary key,name text,age int)')

OperationalError: table student already exists

In [14]:
cur.execute('insert into student(id,name,age) values(1,"andrew",23)')

IntegrityError: UNIQUE constraint failed: student.id

In [15]:
dbcon.commit()

In [11]:
cur.execute('insert into student(id,name,age) values(2,"alex",21)')

In [12]:
dbcon.commit()

In [13]:
cur.execute('insert into student(id,name,age) values(3,"Smith",21)')

In [15]:
cur.execute('insert into student values(4,"kaily",24),(5,"Meera",23),(6,"Lara",25)')

In [16]:
dbcon.commit()

In [16]:
#to view all data we use *
results=cur.execute("select * from student")

for i in results:
    print(i)

(1, 'andrew', 23)
(2, 'alex', 21)
(3, 'Smith', 21)
(4, 'kaily', 24)
(5, 'Meera', 23)
(6, 'Lara', 25)
(7, 'Will', 19)
(8, 'Tia', 20)

In [17]:
results=cur.execute('select id from student')

for i in results:
    print(i)

(1,)
(2,)
(3,)
(4,)
(5,)
(6,)
(7,)
(8,)

In [19]:
results=cur.execute('select name from student')

for i in results:
    print(i)

('andrew',)
('alex',)
('Smith',)
('kaily',)
('Meera',)
('Lara',)

In [20]:
results=cur.execute('select age from student')

for i in results:
    print(i)

(23,)
(21,)
(21,)
(24,)
(23,)
(25,)

In [22]:
#to get data from particular row

results=cur.execute('select * from student where id =1')

for i in results:
    print(i)

(1, 'andrew', 23)

In [18]:
results=cur.execute('select * from student where age>21')

for i in results:
    print(i)

(1, 'andrew', 23)
(4, 'kaily', 24)
(5, 'Meera', 23)
(6, 'Lara', 25)

In [24]:
#to get particular data
results=cur.execute('select age from student where age>22')

for i in results:
    print(i)

(23,)
(24,)
(23,)
(25,)

In [25]:
result= cur.execute('select name,age from student where age==23')

for i in results:
    print(i)

('andrew', 23)
('Meera', 23)

In [29]:
result=cur.execute('select * from student where name= "Meera" ')

for i in result:
    print(i)

(5, 'Meera', 23)

In [30]:
cur.execute('insert into student values(7,"Will",19),(8,"Tia",20)')

dbcon.commit()

In [31]:
result=cur.execute('select * from student')

for i in result:
    print(i)

(1, 'andrew', 23)
(2, 'alex', 21)
(3, 'Smith', 21)
(4, 'kaily', 24)
(5, 'Meera', 23)
(6, 'Lara', 25)
(7, 'Will', 19)
(8, 'Tia', 20)

DT - 25/03/2023

In [2]:
import sqlite3

In [4]:
db=sqlite3.connect('student_marks')

In [19]:
curs=db.cursor()

In [20]:
curs.execute('create table marks (id int primary key, name text, marks int)')

In [22]:
curs.execute('insert into marks (id,name,marks) values(101,"John",56),(102,"Joshua",76),(103,"Sedny",42),(104,"Derek",62),(105,"Yash",76),(106,"Yeeze",84),(107,"Frank",90),(108,"Ginny",46),(109,"Kennedy",56),(110,"Derek",84)')
db.commit()

In [26]:
result=curs.execute('select * from marks')
for i in result:
    print(i)
result

(101, 'John', 56)
(102, 'Joshua', 76)
(103, 'Sedny', 42)
(104, 'Derek', 62)
(105, 'Yash', 76)
(106, 'Yeeze', 84)
(107, 'Frank', 90)
(108, 'Ginny', 46)
(109, 'Kennedy', 56)
(110, 'Derek', 84)

In [27]:
curs.execute('insert into marks values(111,"Nikky",62),(112,"Roy",88),(113,"Loyala",75),(114,"Joshua",94),(115,"Fiona",78)')
db.commit()

In [28]:
result=curs.execute('select * from marks')
result.fetchall()

[(101, 'John', 56),
 (102, 'Joshua', 76),
 (103, 'Sedny', 42),
 (104, 'Derek', 62),
 (105, 'Yash', 76),
 (106, 'Yeeze', 84),
 (107, 'Frank', 90),
 (108, 'Ginny', 46),
 (109, 'Kennedy', 56),
 (110, 'Derek', 84),
 (111, 'Nikky', 62),
 (112, 'Roy', 88),
 (113, 'Loyala', 75),
 (114, 'Joshua', 94),
 (115, 'Fiona', 78)]

In [29]:
result=curs.execute('select * from marks where name="John" ')
result.fetchall()

[(101, 'John', 56)]

In [30]:
result=curs.execute('select name from marks')
for i in result:
    print(i)

('John',)
('Joshua',)
('Sedny',)
('Derek',)
('Yash',)
('Yeeze',)
('Frank',)
('Ginny',)
('Kennedy',)
('Derek',)
('Nikky',)
('Roy',)
('Loyala',)
('Joshua',)
('Fiona',)

In [31]:
result=curs.execute('select marks from marks')
result.fetchall()

[(56,),
 (76,),
 (42,),
 (62,),
 (76,),
 (84,),
 (90,),
 (46,),
 (56,),
 (84,),
 (62,),
 (88,),
 (75,),
 (94,),
 (78,)]

In [33]:
result=curs.execute('select id from marks')
result.fetchall()

[(101,),
 (102,),
 (103,),
 (104,),
 (105,),
 (106,),
 (107,),
 (108,),
 (109,),
 (110,),
 (111,),
 (112,),
 (113,),
 (114,),
 (115,)]

In [35]:
result=curs.execute('select * from marks where id=105')
result.fetchall()

[(105, 'Yash', 76)]

In [36]:
result=curs.execute('select * from marks where id>104')
result.fetchall()

[(105, 'Yash', 76),
 (106, 'Yeeze', 84),
 (107, 'Frank', 90),
 (108, 'Ginny', 46),
 (109, 'Kennedy', 56),
 (110, 'Derek', 84),
 (111, 'Nikky', 62),
 (112, 'Roy', 88),
 (113, 'Loyala', 75),
 (114, 'Joshua', 94),
 (115, 'Fiona', 78)]

In [37]:
result=curs.execute('select * from marks where id<108')
result.fetchall()

[(101, 'John', 56),
 (102, 'Joshua', 76),
 (103, 'Sedny', 42),
 (104, 'Derek', 62),
 (105, 'Yash', 76),
 (106, 'Yeeze', 84),
 (107, 'Frank', 90)]

In [41]:
result=curs.execute('select * from marks where marks=65')
result.fetchall()

[]

In [43]:
result=curs.execute('select * from marks where marks=88')
result.fetchall()

[(112, 'Roy', 88)]

In [44]:
result=curs.execute('select * from marks')
result.fetchall()

[(101, 'John', 56),
 (102, 'Joshua', 76),
 (103, 'Sedny', 42),
 (104, 'Derek', 62),
 (105, 'Yash', 76),
 (106, 'Yeeze', 84),
 (107, 'Frank', 90),
 (108, 'Ginny', 46),
 (109, 'Kennedy', 56),
 (110, 'Derek', 84),
 (111, 'Nikky', 62),
 (112, 'Roy', 88),
 (113, 'Loyala', 75),
 (114, 'Joshua', 94),
 (115, 'Fiona', 78)]

In [45]:
reuslt=curs.execute('select * from marks where marks>75')
result.fetchall()

[(102, 'Joshua', 76),
 (105, 'Yash', 76),
 (106, 'Yeeze', 84),
 (107, 'Frank', 90),
 (110, 'Derek', 84),
 (112, 'Roy', 88),
 (114, 'Joshua', 94),
 (115, 'Fiona', 78)]

In [46]:
result=curs.execute('select * from marks where marks<78')
result.fetchall()

[(101, 'John', 56),
 (102, 'Joshua', 76),
 (103, 'Sedny', 42),
 (104, 'Derek', 62),
 (105, 'Yash', 76),
 (108, 'Ginny', 46),
 (109, 'Kennedy', 56),
 (111, 'Nikky', 62),
 (113, 'Loyala', 75)]

In [47]:
result=curs.execute('select * from marks where marks=76')
result.fetchall()

[(102, 'Joshua', 76), (105, 'Yash', 76)]

In [49]:
result=curs.execute('select * from marks where name="Derek"')
result.fetchall()

[(104, 'Derek', 62), (110, 'Derek', 84)]

In [50]:
result=curs.execute('select * from marks where marks in (56,66,76)')
result.fetchall()

[(101, 'John', 56),
 (102, 'Joshua', 76),
 (105, 'Yash', 76),
 (109, 'Kennedy', 56)]

In [51]:
result=curs.execute('select * from marks where marks in(42,88,92)')
result.fetchall()

[(103, 'Sedny', 42), (112, 'Roy', 88)]

In [52]:
result=curs.execute('select * from marks limit 5')
result.fetchall()

[(101, 'John', 56),
 (102, 'Joshua', 76),
 (103, 'Sedny', 42),
 (104, 'Derek', 62),
 (105, 'Yash', 76)]

### LOGICAL OPERATOR

 NOT , AND , OR , BETWEEN

In [53]:
result=curs.execute('select * from marks where id not in (103,109)')
result.fetchall()

[(101, 'John', 56),
 (102, 'Joshua', 76),
 (104, 'Derek', 62),
 (105, 'Yash', 76),
 (106, 'Yeeze', 84),
 (107, 'Frank', 90),
 (108, 'Ginny', 46),
 (110, 'Derek', 84),
 (111, 'Nikky', 62),
 (112, 'Roy', 88),
 (113, 'Loyala', 75),
 (114, 'Joshua', 94),
 (115, 'Fiona', 78)]

In [54]:
result=curs.execute('select * from marks where marks not in (76,88,42,56)')
result.fetchall()

[(104, 'Derek', 62),
 (106, 'Yeeze', 84),
 (107, 'Frank', 90),
 (108, 'Ginny', 46),
 (110, 'Derek', 84),
 (111, 'Nikky', 62),
 (113, 'Loyala', 75),
 (114, 'Joshua', 94),
 (115, 'Fiona', 78)]

'OR' oparator gives result when if both the values are true or one of them is true, but if none of them are true then it wont give any result

In [64]:
result=curs.execute('select * from marks where marks=88 or id>=109')
result.fetchall()

[(109, 'Kennedy', 56),
 (110, 'Derek', 84),
 (111, 'Nikky', 62),
 (112, 'Roy', 88),
 (113, 'Loyala', 75),
 (114, 'Joshua', 94),
 (115, 'Fiona', 78)]

In [67]:
result=curs.execute('select * from marks where marks=62 and name="Nikky"')
result.fetchall()

[(111, 'Nikky', 62)]

In [65]:
result=curs.execute('select * from marks where marks=88 or id=111')
result.fetchall()

[(111, 'Nikky', 62), (112, 'Roy', 88)]

In [68]:
result=curs.execute('select * from marks where marks =77 or id=119')
result.fetchall()

[]

In [72]:
result=curs.execute('select* from marks where marks= 42 or name ="Joshua"')
result.fetchall()

[(102, 'Joshua', 76), (103, 'Sedny', 42), (114, 'Joshua', 94)]

In [66]:
result=curs.execute('select * from marks where marks = 88 and id =102')
result.fetchall()

[]

'AND' operator will give result only when both the values are true if any one of them is false it wont give any result

In [69]:
result=curs.execute('select * from marks where marks>=76 and marks <=88')
result.fetchall()

[(102, 'Joshua', 76),
 (105, 'Yash', 76),
 (106, 'Yeeze', 84),
 (110, 'Derek', 84),
 (112, 'Roy', 88),
 (115, 'Fiona', 78)]

In [70]:
result=curs.execute('select * from marks where marks > 92 and name="Frank"')
result.fetchall()

[]

In [71]:
result=curs.execute('select * from marks where marks>70 and name = "Derek"')
result.fetchall()

[(110, 'Derek', 84)]

In [73]:
result=curs.execute('select * from marks where marks>60 and marks<80')
result.fetchall()

[(102, 'Joshua', 76),
 (104, 'Derek', 62),
 (105, 'Yash', 76),
 (111, 'Nikky', 62),
 (113, 'Loyala', 75),
 (115, 'Fiona', 78)]

In [74]:
result=curs.execute('select * from marks where marks>56 and marks<92')
result.fetchall()

[(102, 'Joshua', 76),
 (104, 'Derek', 62),
 (105, 'Yash', 76),
 (106, 'Yeeze', 84),
 (107, 'Frank', 90),
 (110, 'Derek', 84),
 (111, 'Nikky', 62),
 (112, 'Roy', 88),
 (113, 'Loyala', 75),
 (115, 'Fiona', 78)]

In [75]:
result=curs.execute('select * from marks where marks>60 and marks<70')
result.fetchall()

[(104, 'Derek', 62), (111, 'Nikky', 62)]

In [90]:
result=curs.execute('select * from marks where marks=99 and name ="Kennedy"')
result.fetchall()

[]

In [91]:
result=curs.execute('select * from marks where marks between 30 and 50')
result.fetchall()

[(103, 'Sedny', 42), (108, 'Ginny', 46)]

In [92]:
result=curs.execute('select * from marks where id between 105 and 111')
result.fetchall()

[(105, 'Yash', 76),
 (106, 'Yeeze', 84),
 (107, 'Frank', 90),
 (108, 'Ginny', 46),
 (109, 'Kennedy', 56),
 (110, 'Derek', 84),
 (111, 'Nikky', 62)]

In [93]:
## null and not null

result=curs.execute('select * from marks where marks is not null')
result.fetchall()

[(101, 'John', 56),
 (102, 'Joshua', 76),
 (103, 'Sedny', 42),
 (104, 'Derek', 62),
 (105, 'Yash', 76),
 (106, 'Yeeze', 84),
 (107, 'Frank', 90),
 (108, 'Ginny', 46),
 (109, 'Kennedy', 56),
 (110, 'Derek', 84),
 (111, 'Nikky', 62),
 (112, 'Roy', 88),
 (113, 'Loyala', 75),
 (114, 'Joshua', 94),
 (115, 'Fiona', 78)]

In [94]:
result=curs.execute('select name from marks where name is null')
result.fetchall()

[]

### ORDER BY CLAUSE

Order by clause is used to get the data in ascending or descending order

In [79]:
result=curs.execute('select * from marks order by name asc')
result.fetchall()

[(104, 'Derek', 62),
 (110, 'Derek', 84),
 (115, 'Fiona', 78),
 (107, 'Frank', 90),
 (108, 'Ginny', 46),
 (101, 'John', 56),
 (102, 'Joshua', 76),
 (114, 'Joshua', 94),
 (109, 'Kennedy', 56),
 (113, 'Loyala', 75),
 (111, 'Nikky', 62),
 (112, 'Roy', 88),
 (103, 'Sedny', 42),
 (105, 'Yash', 76),
 (106, 'Yeeze', 84)]

In [80]:
result=curs.execute('select * from marks order by marks desc')
result.fetchall()

[(114, 'Joshua', 94),
 (107, 'Frank', 90),
 (112, 'Roy', 88),
 (106, 'Yeeze', 84),
 (110, 'Derek', 84),
 (115, 'Fiona', 78),
 (102, 'Joshua', 76),
 (105, 'Yash', 76),
 (113, 'Loyala', 75),
 (104, 'Derek', 62),
 (111, 'Nikky', 62),
 (101, 'John', 56),
 (109, 'Kennedy', 56),
 (108, 'Ginny', 46),
 (103, 'Sedny', 42)]

In [81]:
result=curs.execute('select * from marks order by name desc')
result.fetchall()

[(106, 'Yeeze', 84),
 (105, 'Yash', 76),
 (103, 'Sedny', 42),
 (112, 'Roy', 88),
 (111, 'Nikky', 62),
 (113, 'Loyala', 75),
 (109, 'Kennedy', 56),
 (102, 'Joshua', 76),
 (114, 'Joshua', 94),
 (101, 'John', 56),
 (108, 'Ginny', 46),
 (107, 'Frank', 90),
 (115, 'Fiona', 78),
 (104, 'Derek', 62),
 (110, 'Derek', 84)]

In [82]:
result=curs.execute('select marks from marks order by marks asc')
result.fetchall()

[(42,),
 (46,),
 (56,),
 (56,),
 (62,),
 (62,),
 (75,),
 (76,),
 (76,),
 (78,),
 (84,),
 (84,),
 (88,),
 (90,),
 (94,)]

In [83]:
result=curs.execute('select * from marks order by id desc')
result.fetchall()

[(115, 'Fiona', 78),
 (114, 'Joshua', 94),
 (113, 'Loyala', 75),
 (112, 'Roy', 88),
 (111, 'Nikky', 62),
 (110, 'Derek', 84),
 (109, 'Kennedy', 56),
 (108, 'Ginny', 46),
 (107, 'Frank', 90),
 (106, 'Yeeze', 84),
 (105, 'Yash', 76),
 (104, 'Derek', 62),
 (103, 'Sedny', 42),
 (102, 'Joshua', 76),
 (101, 'John', 56)]

### BASIC AGGREGATE FUNCTION

There are 6 types of aggregate function

1. min --to find minimun
2. max --to find maximum
3. avg --to find average
4. sum --to find the sum
5. count -- to count the number of rows

In [84]:
result=curs.execute('select marks from marks')
result.fetchall()

[(56,),
 (76,),
 (42,),
 (62,),
 (76,),
 (84,),
 (90,),
 (46,),
 (56,),
 (84,),
 (62,),
 (88,),
 (75,),
 (94,),
 (78,)]

In [85]:
# to get only minimum mark

result=curs.execute('select min(marks) from marks')
result.fetchone()

(42,)

In [86]:
result=curs.execute('select max(marks) from marks')
result.fetchone()

(94,)

In [87]:
result=curs.execute('select avg(marks) from marks')
result.fetchall()

[(71.26666666666667,)]

In [88]:
result=curs.execute('select sum(marks) from marks')
result.fetchall()

[(1069,)]

In [89]:
result=curs.execute('select count(id) from marks')
result.fetchall()

[(15,)]

### LIKE (' % ') operator

% --many charecter

_ --single charecter

In [98]:
result=curs.execute('select * from marks where name like "A%"')
result.fetchall()

[]

In [99]:
result=curs.execute('select * from marks where name like "f%"')
result.fetchall()

[(107, 'Frank', 90), (115, 'Fiona', 78)]

In [100]:
result=curs.execute('select * from marks where name like "%y"')
result.fetchall()

[(103, 'Sedny', 42),
 (108, 'Ginny', 46),
 (109, 'Kennedy', 56),
 (111, 'Nikky', 62),
 (112, 'Roy', 88)]

In [101]:
result=curs.execute('select * from marks where name like "_o%"')
result.fetchall()

[(101, 'John', 56),
 (102, 'Joshua', 76),
 (112, 'Roy', 88),
 (113, 'Loyala', 75),
 (114, 'Joshua', 94)]

In [102]:
result=curs.execute('select * from marks where name like "%o%"')
result.fetchall()

[(101, 'John', 56),
 (102, 'Joshua', 76),
 (112, 'Roy', 88),
 (113, 'Loyala', 75),
 (114, 'Joshua', 94),
 (115, 'Fiona', 78)]

In [106]:
result=curs.execute('select * from marks where name like "__kk%"')
result.fetchall()

[(111, 'Nikky', 62)]

In [107]:
result=curs.execute('select * from marks where name like "__nn%"')
result.fetchall()

[(108, 'Ginny', 46), (109, 'Kennedy', 56)]

In [108]:
result=curs.execute('select * from marks where name like "%h%"')
result.fetchall()

[(101, 'John', 56),
 (102, 'Joshua', 76),
 (105, 'Yash', 76),
 (114, 'Joshua', 94)]

In [109]:
result=curs.execute('select * from marks where name like "J%a"')
result.fetchall()

[(102, 'Joshua', 76), (114, 'Joshua', 94)]

### DDL, DML, DCL
26/03/2023

In [1]:
import sqlite3

In [5]:
db3=sqlite3.connect('mark3_database')

cu=db3.cursor()

In [6]:
cu.execute('create table mark3 (id int, name text, mark int)')

In [9]:
db3.commit()

In [11]:
cu.execute('insert into mark3(id,name,mark) values(1,"Neha",62), (2,"Umang",73),(3,"Samaira",67),(4,"Tia",90)')

db3.commit()

In [13]:
res=cu.execute('select * from mark3')
res.fetchall()

[(1, 'Neha', 62), (2, 'Umang', 73), (3, 'Samaira', 67), (4, 'Tia', 90)]

### UPDATE

Update works for row if you want to change some data in the table.

In [15]:
sql="update mark3 set mark=83 where id=3"
cu.execute(sql)
db3.commit()

In [17]:
re=cu.execute('select * from mark3')
re.fetchall()

[(1, 'Neha', 62), (2, 'Umang', 73), (3, 'Samaira', 83), (4, 'Tia', 90)]

In [18]:
sql="update mark3 set mark=77 where id in(1,2)"
cu.execute(sql)
db3.commit()

res=cu.execute('select * from mark3')
res.fetchall()

[(1, 'Neha', 77), (2, 'Umang', 77), (3, 'Samaira', 83), (4, 'Tia', 90)]

In [19]:
sql="update mark3 set name='Asha' where id=2"
cu.execute(sql)
db3.commit()

res=cu.execute('select * from mark3')
res.fetchall()

[(1, 'Neha', 77), (2, 'Asha', 77), (3, 'Samaira', 83), (4, 'Tia', 90)]

### DELETE

Delete command is going to delete specific row from the table

In [20]:
sql="delete from mark3 where id=3"
cu.execute(sql)
db3.commit()

res=cu.execute('select *from mark3')
res.fetchall()

[(1, 'Neha', 77), (2, 'Asha', 77), (4, 'Tia', 90)]

### DROP

Drop command is going to change the structure of the table or drop the whole column from the table

In [23]:
sql='alter table mark3 drop mark'
cu.execute(sql)
db3.commit()

res=cu.execute('select * from mark3')
res.fetchall()

[(1, 'Neha'), (2, 'Asha'), (4, 'Tia')]

### Adding data in table with csv file directly

In [29]:
#creating database

db=sqlite3.connect('empdata.db')

curr=db.cursor()

In [30]:
#creating table under database

curr.execute('create table employee(uan int, name text, Salary int)')
db.commit()

### Inserting records from CSV file

In [35]:
with open('emp_data.csv','r') as file:   #open the csv file saved in jupyter notebook in 'r'read mode as file name
    
    total_records=0                     #the initial record will be zero
    
    for row in file:                   #the loop will go inside each and every row, count the first row aa 1 and gradually increase
        curr.execute("insert into employee values(?,?,?)",row.split(","))      # the ? here is for giving dynamic data
        db.commit()
        total_records+=1
print(total_records,'Records inserted')

105 Records inserted

In [40]:
res=curr.execute('select * from employee')
for i in res:
    print(i)

(100422664271, 'ABHIRAM BARJO', 18486)
(100422664271, 'ABHIRAM BARJO', 18486)
(100422664271, 'ABHIRAM BARJO', 18486)
(100422671561, 'ABHIRAM KANDULNA', 15470)
(100527883460, 'ALFRED MUNDA', 18486)
(100098445825, 'ALOMONI BAGUTI', 15470)
(100527628569, 'ANANDA MASHI SURIN', 18486)
(100088746704, 'ARABINDA MALLICK', 15470)
(100925716145, 'ASHADHU NAIK', 15470)
(100618153729, 'ASRANTI KONGADI', 11925)
(100885095130, 'BEGUNI NAIK', 15470)
(100110297287, 'BHAJAN CHANDRA PRADHAN', 18486)
(100778380292, 'BHARAT NAIK', 5950)
(101551213878, 'BHARAT SINGH', 12402)
(100919411716, 'BHIMSEN JAYPURIA', 12402)
(101301217089, 'BIKTAR KUMAR MUNDA', 15470)
(100115313133, 'BINOD THAPPA', 12402)
(100794217492, 'BISHNU GOCHHAYAT', 15470)
(101379478827, 'BISWAJIT SUTAR', 15470)
(101343182586, 'CHANDAN MAHARANA', 13685)
(101352271535, 'DAMU PATRA', 11305)
(101391043816, 'DASARATH NAIK', 15470)
(101907201577, 'DAYANIDHI PATRA', 6678)
(100142870595, 'DEEPTI REKHA PARIDA', 18486)
(100135706390, 'DHARAMDAS SANTYAL HARAD', 18486)
(101610649396, 'DUKHI GOCHHAYAT', 11448)
(101155902759, 'GEORGE HASDA', 15470)
(100156174360, 'GOVINDA DASH', 18486)
(101578957519, 'GUNANIDHI GOCHHAET', 10017)
(100914434573, 'HEMANTA KUMAR BEHERA', 15470)
(100164717706, 'HIRA GOCHHAYAT', 6678)
(100618134748, 'IGNESH PURTY', 18486)
(100422664791, 'ILYAS BARJO', 18486)
(100466442567, 'JADUNATH PATRA', 15470)
(101366511547, 'JAKRIAS TOPNO', 18486)
(100553145673, 'JEMS NIRAL SINDURI', 18486)
(100884247730, 'JITENDRA GOCHHAYAT', 17775)
(100794488320, 'JITENDRA KUMAR DASH', 12402)
(100777660834, 'JOGINDRA SETHI', 16353)
(101907202999, 'JOHN TOPNO', 8109)
(101512990608, 'JUNAID ALLAM', 15470)
(100926582328, 'JUNATHAN BHUINYA', 12495)
(100921165458, 'JUNUL BHENGRA', 10710)
(100506750026, 'JURIA SURIN', 15470)
(100530097731, 'KAMLESH BARLA', 18486)
(100687994005, 'KSHIROD KUMAR MAHANTA', 18486)
(100529706288, 'LABA PATRA', 18486)
(101828481492, 'LALITA GOCHHAYAT', 12402)
(100922642008, 'LEBLAN HORO', 14280)
(100618541016, 'MADHAB CHANDRA MUNDARY', 18486)
(100618749848, 'MAKU GOCHHAYAT', 18486)
(101730481944, 'MANOJ KUMAR NAYAK', 15470)
(100223591841, 'MARSALAM MANSID PURTY', 18486)
(100422602700, 'MASI CHARAN BODRA', 18486)
(100876463745, 'MUNA GOCHHAYAT', 12402)
(100248701255, 'NAKULA KUMAR PATRA', 18486)
(101398200898, 'NARAYAN PATRA', 15470)
(100794052811, 'NARAYAN SETHY', 15470)
(100889444465, 'NIALI NAIK', 15470)
(100794409217, 'NIRAKAR GOCHHAYAT', 15470)
(101514347487, 'NIRANJAN SAHOO', 12402)
(101209770925, 'NIRUPA GOCHHAET', 12402)
(100915462440, 'PABITRA MOHAN PATRA', 15470)
(101514112907, 'PANKAJ KUMAR JENA', 15470)
(100272048920, 'PITAMBAR PATRA', 14931)
(101513851018, 'PRABIR KUMAR PRADHAN', 15470)
(100795396160, 'PRADIP KUMAR KABI', 18486)
(101379478836, 'PRADIP KUMAR PALLAI', 14875)
(101417733572, 'PRAMOD KUMAR MAHAKUD', 11305)
(101576590969, 'PRASANTA GOCHHAYAT', 11448)
(100795443684, 'PRASANTA KUMAR NAYAK', 18486)
(100507418561, 'PUTKAR MUNDA', 15470)
(101730798566, 'RABI GOCHHAYAT', 12402)
(101488313893, 'RAJ MOHAN NAIK', 15470)
(100918212648, 'RAJESH GUDIA', 15470)
(100794573052, 'RAKESH GOCHHAYAT', 12402)
(101360165337, 'RAM MUNDA', 10494)
(101703248421, 'ROHIT GOCHHAYAT', 12402)
(100531511296, 'ROSAN MUNDA', 15470)
(101584117321, 'SAGAR GOCHHAYAT', 12402)
(101391043828, 'SAMIR SUTAR', 15470)
(100528456890, 'SANTOSH KUMAR MULI', 14931)
(100422955490, 'SASHIKANTA DASH', 18486)
(101897283082, 'SHAMBHU KANSARI', 11925)
(101873052392, 'SIBA DEHURI', 3339)
(100422579389, 'SIMON HEMBRAM', 18486)
(101897279180, 'SK ESRAR', 11925)
(101387680993, 'SK SABIR', 14875)
(101560352934, 'SMRUTI REKHA PARIDA', 18486)
(101387680929, 'SUBRAT KAR', 7632)
(100506568400, 'SUDAM NAYAK', 15470)
(100926608492, 'SUDARSAN NAIK', 11305)
(100794573010, 'SUDHIR GOCHHAYAT', 15470)
(101502522764, 'SUMIT BHENGRA', 9063)
(101417733564, 'SUNAND KUMAR NATH', 11925)
(100916501158, 'SUNIL BANDHIA', 14875)
(101367832981, 'SUNIL GOCHHAYAT', 14280)
(100506953067, 'SURENDRA BEHERA', 15470)
(100779683412, 'SURSEN TOPNO', 18486)
(101897141700, 'SUSANTA KUMAR LENKA', 11925)
(100888726179, 'SUSARI  BODRA', 12402)
(100602274852, 'TRINATH MUNDA', 15470)
(101195556061, 'TUKUNA BEHERA', 8586)
(100794679310, 'TUNI GOCHHAYAT', 12402)
(101728058545, 'TURAN BARJO', 15470)
(100527621485, 'TURAN TOPNO', 15470)
(101749452308, 'UPENDRA GOCHHAYAT', 11925)

In [42]:
res=curr.execute('select name from employee where uan=101367832981')

res.fetchone()

('SUNIL GOCHHAYAT',)

In [43]:
res=curr.execute('select min(salary) from employee')

res.fetchone()

(3339,)

In [44]:
res=curr.execute('select max(salary) from employee')
res.fetchall()

[(18486,)]

In [45]:
res=curr.execute('select avg(salary) from employee')
res.fetchall()

[(14600.29906542056,)]

In [46]:
res=curr.execute('select sum(salary) from employee')

res.fetchall()

[(1562232,)]

27-03-2023

PRIMARY KEY : UNIQUE AND NOT NULL
    
CONSTRAINTS: 
    
UNIQUE: enter only unique values, no duplicate values
NOT NULL: no blank values can be inserted in table

In [1]:
import sqlite3

db=sqlite3.connect('sports_database')

In [2]:
cur=db.cursor()

In [14]:
cur.execute("create table sports (id int primary key, sportsname text unique, country text notnull, dateofevent date)")
db.commit()

OperationalError: table sports already exists

In [7]:
cur.execute("insert into sports values(101,'CRICKET','ENGLAND',2022-08-23)")

res=cur.execute('select * from sports')
res.fetchall()

[(1, 'CRICKET', 'ENGLAND', 1991), (101, 'CRICKET', 'ENGLAND', 1991)]

In [8]:
res=cur.execute('delete from sports where id=101')
res.fetchall()

[]

In [9]:
res=cur.execute('select * from sports')
res.fetchall()

[(1, 'CRICKET', 'ENGLAND', 1991)]

In [13]:
cur.execute('insert into sports values(4,"TENNIS","FRANCE","2023-03-4")')
db.commit()

res=cur.execute('select * from sports')
res.fetchall()

[(1, 'CRICKET', 'ENGLAND', 1991),
 (2, 'TENNIS', 'FRANCE', '2023-03-4'),
 (3, 'TENNIS', 'FRANCE', '2023-03-4'),
 (4, 'TENNIS', 'FRANCE', '2023-03-4')]

In [16]:
cur.execute('insert into sports values(5,"Hockey","INDIA","2023-04-23")')
db.commit()

res=cur.execute('select* from sports')
res.fetchall()

[(1, 'CRICKET', 'ENGLAND', 1991),
 (2, 'TENNIS', 'FRANCE', '2023-03-4'),
 (3, 'TENNIS', 'FRANCE', '2023-03-4'),
 (4, 'TENNIS', 'FRANCE', '2023-03-4'),
 (5, 'Hockey', 'INDIA', '2023-04-23')]

### EMPLOYEE database with DB and Python programmatically

In [17]:
import sqlite3

db=sqlite3.connect('emp_database')

In [33]:
def sql_table(db):                     #create a function
    cur=db.cursor()                    #Create cursor
    cur.execute("create table employees(id int, name text, salary int, dept text, position text,doj date)")
    db.commit()

In [34]:
sql_table(db)                         #call the user defined function and pass the connection db because this connection is required to 

cur=db.cursor()
cur.execute("insert into employees values('1','STEPHAN',80322,'ADMINISTRATION','MANAGER','09-04-2011')")


res=cur.execute('select * from employees')
res.fetchall()

OperationalError: table employees already exists

In [35]:
db.commit()

# here all the static/manual datas are given

In [38]:
# to provide dynamic data we need to give ? in place of values

def sql_insert(db,entities):
    cur=db.cursor()
    cur.execute('insert into employees (id,name,salary,dept,position,doj) values(?,?,?,?,?,?)',entities)

In [39]:
entities=(2,"DRAKE",32932,"HR","RECRUITER","2022-06-3")

sql_insert(db,entities)

In [40]:
entities=(2,'DRAKE',32932,'HR','RECRUITER','2022-06-3')

In [41]:
sql_insert(db,entities)

In [42]:
entitties=(3,'THOMAS',40432,'IT','ENGINEER','2021-03-23')
sql_insert(db,entities)
entities=(4,'BELLA',123743,'IT','TESTER','2019-04-30')
sql_insert(db,entities)
entities=(5,'LAURA',56732,'ADMINISTRATION','ASST.MANAGERG','2016-04-17')
sql_insert(db,entities)
entities=(6,'JACK',32727,'HR','MANAGEGR','2018-4-8')
sql_insert(db,entities)
entities=(7,'ANDREW',37282,'SALES','SALES EXECUTIVE','2014-9-21')
sql_insert(db,entities)

In [44]:
res=cur.execute('select* from employees')
res.fetchall()

[(1, 'STEPHAN', 80322, 'ADMINISTRATION', 'MANAGER', '09-04-2011'),
 (2, 'DRAKE', 32932, 'HR', 'RECRUITER', '2022-06-3'),
 (2, 'DRAKE', 32932, 'HR', 'RECRUITER', '2022-06-3'),
 (2, 'DRAKE', 32932, 'HR', 'RECRUITER', '2022-06-3'),
 (4, 'BELLA', 123743, 'IT', 'TESTER', '2019-04-30'),
 (5, 'LAURA', 56732, 'ADMINISTRATION', 'ASST.MANAGERG', '2016-04-17'),
 (6, 'JACK', 32727, 'HR', 'MANAGEGR', '2018-4-8'),
 (7, 'ANDREW', 37282, 'SALES', 'SALES EXECUTIVE', '2014-9-21')]

In [47]:
### giving sql queries

#update
cur.execute('update employees set id=3,name="HARRY" where id=2')
db.commit()

res=cur.execute('select*from employees')
res.fetchall()

[(1, 'STEPHAN', 80322, 'ADMINISTRATION', 'MANAGER', '09-04-2011'),
 (3, 'HARRY', 32932, 'HR', 'RECRUITER', '2022-06-3'),
 (3, 'HARRY', 32932, 'HR', 'RECRUITER', '2022-06-3'),
 (3, 'HARRY', 32932, 'HR', 'RECRUITER', '2022-06-3'),
 (4, 'BELLA', 123743, 'IT', 'TESTER', '2019-04-30'),
 (5, 'LAURA', 56732, 'ADMINISTRATION', 'ASST.MANAGERG', '2016-04-17'),
 (6, 'JACK', 32727, 'HR', 'MANAGEGR', '2018-4-8'),
 (7, 'ANDREW', 37282, 'SALES', 'SALES EXECUTIVE', '2014-9-21')]

In [48]:
entities=(2,'ANDREW',32532,'IT','ENGINEER','2019-5-21')
sql_insert(db,entities)

In [49]:
res=cur.execute('select*from employees')
res.fetchall()

[(1, 'STEPHAN', 80322, 'ADMINISTRATION', 'MANAGER', '09-04-2011'),
 (3, 'HARRY', 32932, 'HR', 'RECRUITER', '2022-06-3'),
 (3, 'HARRY', 32932, 'HR', 'RECRUITER', '2022-06-3'),
 (3, 'HARRY', 32932, 'HR', 'RECRUITER', '2022-06-3'),
 (4, 'BELLA', 123743, 'IT', 'TESTER', '2019-04-30'),
 (5, 'LAURA', 56732, 'ADMINISTRATION', 'ASST.MANAGERG', '2016-04-17'),
 (6, 'JACK', 32727, 'HR', 'MANAGEGR', '2018-4-8'),
 (7, 'ANDREW', 37282, 'SALES', 'SALES EXECUTIVE', '2014-9-21'),
 (2, 'ANDREW', 32532, 'IT', 'ENGINEER', '2019-5-21')]

In [51]:
#delete

cur.execute('delete from employees where id=3')
db.commit()

res=cur.execute('select* from employees')
res.fetchall()

[(1, 'STEPHAN', 80322, 'ADMINISTRATION', 'MANAGER', '09-04-2011'),
 (4, 'BELLA', 123743, 'IT', 'TESTER', '2019-04-30'),
 (5, 'LAURA', 56732, 'ADMINISTRATION', 'ASST.MANAGERG', '2016-04-17'),
 (6, 'JACK', 32727, 'HR', 'MANAGEGR', '2018-4-8'),
 (7, 'ANDREW', 37282, 'SALES', 'SALES EXECUTIVE', '2014-9-21'),
 (2, 'ANDREW', 32532, 'IT', 'ENGINEER', '2019-5-21')]

In [54]:
entities=(3,'HARRY',32921,'HR','RECRUITER','2019-7-15')
sql_insert(db,entities)

In [55]:
res=cur.execute('select* from employees')
res.fetchall()

[(1, 'STEPHAN', 80322, 'ADMINISTRATION', 'MANAGER', '09-04-2011'),
 (4, 'BELLA', 123743, 'IT', 'TESTER', '2019-04-30'),
 (5, 'LAURA', 56732, 'ADMINISTRATION', 'ASST.MANAGERG', '2016-04-17'),
 (6, 'JACK', 32727, 'HR', 'MANAGEGR', '2018-4-8'),
 (7, 'ANDREW', 37282, 'SALES', 'SALES EXECUTIVE', '2014-9-21'),
 (2, 'ANDREW', 32532, 'IT', 'ENGINEER', '2019-5-21'),
 (3, 'HARRY', 32921, 'HR', 'RECRUITER', '2019-7-15')]

In [57]:
res=cur.execute('select * from employees order by id asc')
res.fetchall()

[(1, 'STEPHAN', 80322, 'ADMINISTRATION', 'MANAGER', '09-04-2011'),
 (2, 'ANDREW', 32532, 'IT', 'ENGINEER', '2019-5-21'),
 (3, 'HARRY', 32921, 'HR', 'RECRUITER', '2019-7-15'),
 (4, 'BELLA', 123743, 'IT', 'TESTER', '2019-04-30'),
 (5, 'LAURA', 56732, 'ADMINISTRATION', 'ASST.MANAGERG', '2016-04-17'),
 (6, 'JACK', 32727, 'HR', 'MANAGEGR', '2018-4-8'),
 (7, 'ANDREW', 37282, 'SALES', 'SALES EXECUTIVE', '2014-9-21')]

In [58]:
res=cur.execute('select * from employees where salary>20384 and name="HARREY" ')
res.fetchall()

[]

In [63]:
res=cur.execute('select * from employees where id between 3 and 8 ')
res.fetchall()

[(4, 'BELLA', 123743, 'IT', 'TESTER', '2019-04-30'),
 (5, 'LAURA', 56732, 'ADMINISTRATION', 'ASST.MANAGERG', '2016-04-17'),
 (6, 'JACK', 32727, 'HR', 'MANAGEGR', '2018-4-8'),
 (7, 'ANDREW', 37282, 'SALES', 'SALES EXECUTIVE', '2014-9-21'),
 (3, 'HARRY', 32921, 'HR', 'RECRUITER', '2019-7-15')]

In [64]:
res=cur.execute('select sum(salary) from employees')
res.fetchall()

[(396259,)]

In [65]:
res=cur.execute("select min(salary) from employees")
res.fetchall()

[(32532,)]

In [68]:
res=cur.execute('select * from employees where dept="IT"')
res.fetchall()

[(4, 'BELLA', 123743, 'IT', 'TESTER', '2019-04-30'),
 (2, 'ANDREW', 32532, 'IT', 'ENGINEER', '2019-5-21')]

In [69]:
res=cur.execute('select count(id) from employees')
res.fetchall()

[(7,)]

In [71]:
res=cur.execute('select distinct(dept) from employees')
res.fetchall()

[('ADMINISTRATION',), ('IT',), ('HR',), ('SALES',)]

In [72]:
res=cur.execute('select distinct(position) from employees')
res.fetchall()

[('MANAGER',),
 ('TESTER',),
 ('ASST.MANAGERG',),
 ('MANAGEGR',),
 ('SALES EXECUTIVE',),
 ('ENGINEER',),
 ('RECRUITER',)]

In [73]:
res=cur.execute('select count(distinct(position)) from employees')
res.fetchall()

[(7,)]

In [74]:
res=cur.execute('select sum(salary),dept from employees group by dept')
res.fetchall()

[(137054, 'ADMINISTRATION'), (65648, 'HR'), (156275, 'IT'), (37282, 'SALES')]

In [75]:
res=cur.execute('select sum(salary),position from employees group by position')
res.fetchall()

[(56732, 'ASST.MANAGERG'),
 (32532, 'ENGINEER'),
 (32727, 'MANAGEGR'),
 (80322, 'MANAGER'),
 (32921, 'RECRUITER'),
 (37282, 'SALES EXECUTIVE'),
 (123743, 'TESTER')]

In [76]:
res=cur.execute('select sum(salary),position from employees group by dept')
res.fetchall()

[(137054, 'MANAGER'),
 (65648, 'MANAGEGR'),
 (156275, 'TESTER'),
 (37282, 'SALES EXECUTIVE')]

In [77]:
# we can also create function for these query

#creating the function

def sql_query(sql):               #creating the function
    cur=db.cursor()               #creating the cursor
    res=cur.execute(sql)          #creating the execution
    return res                    #returning the execution

In [78]:
# make query
sql="select * from employees"

In [80]:
# calling the function

respond=sql_query(sql)
respond.fetchall()

[(1, 'STEPHAN', 80322, 'ADMINISTRATION', 'MANAGER', '09-04-2011'),
 (4, 'BELLA', 123743, 'IT', 'TESTER', '2019-04-30'),
 (5, 'LAURA', 56732, 'ADMINISTRATION', 'ASST.MANAGERG', '2016-04-17'),
 (6, 'JACK', 32727, 'HR', 'MANAGEGR', '2018-4-8'),
 (7, 'ANDREW', 37282, 'SALES', 'SALES EXECUTIVE', '2014-9-21'),
 (2, 'ANDREW', 32532, 'IT', 'ENGINEER', '2019-5-21'),
 (3, 'HARRY', 32921, 'HR', 'RECRUITER', '2019-7-15')]

In [83]:
sql="select name from employees where dept='IT' "
respond=sql_query(sql)
respond.fetchall()

[('BELLA',), ('ANDREW',)]

In [84]:
sql="select avg(salary) from employees"
respond=sql_query(sql)
respond.fetchall()

[(56608.42857142857,)]

In [85]:
sql="select * from employees order by name desc"
res=sql_query(sql)
res.fetchall()

[(1, 'STEPHAN', 80322, 'ADMINISTRATION', 'MANAGER', '09-04-2011'),
 (5, 'LAURA', 56732, 'ADMINISTRATION', 'ASST.MANAGERG', '2016-04-17'),
 (6, 'JACK', 32727, 'HR', 'MANAGEGR', '2018-4-8'),
 (3, 'HARRY', 32921, 'HR', 'RECRUITER', '2019-7-15'),
 (4, 'BELLA', 123743, 'IT', 'TESTER', '2019-04-30'),
 (7, 'ANDREW', 37282, 'SALES', 'SALES EXECUTIVE', '2014-9-21'),
 (2, 'ANDREW', 32532, 'IT', 'ENGINEER', '2019-5-21')]

In [86]:
sql="select sum(salary),dept from employees group by dept"
res=sql_query(sql)
res.fetchall()

[(137054, 'ADMINISTRATION'), (65648, 'HR'), (156275, 'IT'), (37282, 'SALES')]

# Referential Integrity

used to maintain data consistancy between two tables

In [1]:
import sqlite3

In [2]:
db=sqlite3.connect('course_database')

In [5]:
cur=db.cursor()

In [7]:
cur.execute('create table student (id int primary key, name text, age int,course_id int)')
db.commit

OperationalError: table student already exists

In [11]:
res=cur.execute('select * from student')

res.fetchall()

[]

In [13]:
cur.execute('create table course (courseid int,cname text,time int)')
db.commit()

In [15]:
cur.execute('create table students(roll_no int,name text, age int, courseid int,foreign key(courseid) references course(courseid))')

In [17]:
cur.execute("insert into course values(75,'DataScience',12),(12,'DSA',4),(24,'FULLSTACK',3),(34,'AWS/DEVOPS',4)")
db.commit()

In [21]:
cur.execute("insert into students values(1,'Alana',23,75),(2,'Garima',32,12),(3,'Travis',25,24),(4,'Sammy',21,75),(5,'Kenny',22,12),(6,'Paula',21,34),(7,'Issak',20,24),(8,'Danny',22,34)")
db.commit()

In [22]:
res=cur.execute('select * from students')
res.fetchall()

[(1, 'Alana', 23, 75),
 (2, 'Garima', 32, 12),
 (3, 'Travis', 25, 24),
 (4, 'Sammy', 21, 75),
 (5, 'Kenny', 22, 12),
 (6, 'Paula', 21, 34),
 (7, 'Issak', 20, 24),
 (8, 'Danny', 22, 34)]

In [24]:
cur.execute("insert into students values(9,'Rudolf',22,Null),(10,'Jems',23,Null)")
db.commit()

In [26]:
res=cur.execute('select*from students')
res.fetchall()

[(1, 'Alana', 23, 75),
 (2, 'Garima', 32, 12),
 (3, 'Travis', 25, 24),
 (4, 'Sammy', 21, 75),
 (5, 'Kenny', 22, 12),
 (6, 'Paula', 21, 34),
 (7, 'Issak', 20, 24),
 (8, 'Danny', 22, 34),
 (9, 'Rudolf', 22, None),
 (10, 'Jems', 23, None)]

In [28]:
res=cur.execute('select courseid from course where cname="FULLSTACK"')
res.fetchall()

[(24,), (24,)]

In [30]:
res=cur.execute('select courseid from course where cname="DSA"')
res.fetchall()

[(12,), (12,)]

In [31]:
res=cur.execute('select courseid from course where cname="AWS/DEVOPS"')
res.fetchall()

[(34,), (34,)]

## Subquery

In [34]:
res=cur.execute('select * from students where courseid=(select courseid from course where cname="AWS/DEVOPS")')
res.fetchall()

[(6, 'Paula', 21, 34), (8, 'Danny', 22, 34)]

In [35]:
res=cur.execute('select * from students where courseid=(select courseid from course where time=3)')
res.fetchall()

[(3, 'Travis', 25, 24), (7, 'Issak', 20, 24)]

In [45]:
res=cur.execute('select * from course where courseid=(select courseid from students where roll_no=1)')
res.fetchall()

[(75, 'DataScience', 12), (75, 'DataScience', 12)]

## JOIN

Inner Join: Returns matching values in both the sides
Left Join: Returns left side value
Right Join: Returns right side value

### INNER JOIN

In [47]:
res=cur.execute("select students.roll_no,students.name,course.cname,course.courseid FROM students inner join course")
res.fetchall()

[(1, 'Alana', 'DataScience', 75),
 (1, 'Alana', 'DSA', 12),
 (1, 'Alana', 'FULLSTACK', 24),
 (1, 'Alana', 'AWS/DEVOPS', 34),
 (1, 'Alana', 'DataScience', 75),
 (1, 'Alana', 'DSA', 12),
 (1, 'Alana', 'FULLSTACK', 24),
 (1, 'Alana', 'AWS/DEVOPS', 34),
 (2, 'Garima', 'DataScience', 75),
 (2, 'Garima', 'DSA', 12),
 (2, 'Garima', 'FULLSTACK', 24),
 (2, 'Garima', 'AWS/DEVOPS', 34),
 (2, 'Garima', 'DataScience', 75),
 (2, 'Garima', 'DSA', 12),
 (2, 'Garima', 'FULLSTACK', 24),
 (2, 'Garima', 'AWS/DEVOPS', 34),
 (3, 'Travis', 'DataScience', 75),
 (3, 'Travis', 'DSA', 12),
 (3, 'Travis', 'FULLSTACK', 24),
 (3, 'Travis', 'AWS/DEVOPS', 34),
 (3, 'Travis', 'DataScience', 75),
 (3, 'Travis', 'DSA', 12),
 (3, 'Travis', 'FULLSTACK', 24),
 (3, 'Travis', 'AWS/DEVOPS', 34),
 (4, 'Sammy', 'DataScience', 75),
 (4, 'Sammy', 'DSA', 12),
 (4, 'Sammy', 'FULLSTACK', 24),
 (4, 'Sammy', 'AWS/DEVOPS', 34),
 (4, 'Sammy', 'DataScience', 75),
 (4, 'Sammy', 'DSA', 12),
 (4, 'Sammy', 'FULLSTACK', 24),
 (4, 'Sammy', 'AWS/DEVOPS', 34),
 (5, 'Kenny', 'DataScience', 75),
 (5, 'Kenny', 'DSA', 12),
 (5, 'Kenny', 'FULLSTACK', 24),
 (5, 'Kenny', 'AWS/DEVOPS', 34),
 (5, 'Kenny', 'DataScience', 75),
 (5, 'Kenny', 'DSA', 12),
 (5, 'Kenny', 'FULLSTACK', 24),
 (5, 'Kenny', 'AWS/DEVOPS', 34),
 (6, 'Paula', 'DataScience', 75),
 (6, 'Paula', 'DSA', 12),
 (6, 'Paula', 'FULLSTACK', 24),
 (6, 'Paula', 'AWS/DEVOPS', 34),
 (6, 'Paula', 'DataScience', 75),
 (6, 'Paula', 'DSA', 12),
 (6, 'Paula', 'FULLSTACK', 24),
 (6, 'Paula', 'AWS/DEVOPS', 34),
 (7, 'Issak', 'DataScience', 75),
 (7, 'Issak', 'DSA', 12),
 (7, 'Issak', 'FULLSTACK', 24),
 (7, 'Issak', 'AWS/DEVOPS', 34),
 (7, 'Issak', 'DataScience', 75),
 (7, 'Issak', 'DSA', 12),
 (7, 'Issak', 'FULLSTACK', 24),
 (7, 'Issak', 'AWS/DEVOPS', 34),
 (8, 'Danny', 'DataScience', 75),
 (8, 'Danny', 'DSA', 12),
 (8, 'Danny', 'FULLSTACK', 24),
 (8, 'Danny', 'AWS/DEVOPS', 34),
 (8, 'Danny', 'DataScience', 75),
 (8, 'Danny', 'DSA', 12),
 (8, 'Danny', 'FULLSTACK', 24),
 (8, 'Danny', 'AWS/DEVOPS', 34),
 (9, 'Rudolf', 'DataScience', 75),
 (9, 'Rudolf', 'DSA', 12),
 (9, 'Rudolf', 'FULLSTACK', 24),
 (9, 'Rudolf', 'AWS/DEVOPS', 34),
 (9, 'Rudolf', 'DataScience', 75),
 (9, 'Rudolf', 'DSA', 12),
 (9, 'Rudolf', 'FULLSTACK', 24),
 (9, 'Rudolf', 'AWS/DEVOPS', 34),
 (10, 'Jems', 'DataScience', 75),
 (10, 'Jems', 'DSA', 12),
 (10, 'Jems', 'FULLSTACK', 24),
 (10, 'Jems', 'AWS/DEVOPS', 34),
 (10, 'Jems', 'DataScience', 75),
 (10, 'Jems', 'DSA', 12),
 (10, 'Jems', 'FULLSTACK', 24),
 (10, 'Jems', 'AWS/DEVOPS', 34)]

In [48]:
res=cur.execute("select students.roll_no,students.name,course.cname,course.courseid FROM students inner join course on students.courseid=course.courseid")
res.fetchall()

[(1, 'Alana', 'DataScience', 75),
 (1, 'Alana', 'DataScience', 75),
 (2, 'Garima', 'DSA', 12),
 (2, 'Garima', 'DSA', 12),
 (3, 'Travis', 'FULLSTACK', 24),
 (3, 'Travis', 'FULLSTACK', 24),
 (4, 'Sammy', 'DataScience', 75),
 (4, 'Sammy', 'DataScience', 75),
 (5, 'Kenny', 'DSA', 12),
 (5, 'Kenny', 'DSA', 12),
 (6, 'Paula', 'AWS/DEVOPS', 34),
 (6, 'Paula', 'AWS/DEVOPS', 34),
 (7, 'Issak', 'FULLSTACK', 24),
 (7, 'Issak', 'FULLSTACK', 24),
 (8, 'Danny', 'AWS/DEVOPS', 34),
 (8, 'Danny', 'AWS/DEVOPS', 34)]

### LEFT JOIN

In [49]:
res=cur.execute("select students.roll_no,students.name,course.courseid,course.cname from students left join course on students.courseid = course.courseid")
res.fetchall()

[(1, 'Alana', 75, 'DataScience'),
 (1, 'Alana', 75, 'DataScience'),
 (2, 'Garima', 12, 'DSA'),
 (2, 'Garima', 12, 'DSA'),
 (3, 'Travis', 24, 'FULLSTACK'),
 (3, 'Travis', 24, 'FULLSTACK'),
 (4, 'Sammy', 75, 'DataScience'),
 (4, 'Sammy', 75, 'DataScience'),
 (5, 'Kenny', 12, 'DSA'),
 (5, 'Kenny', 12, 'DSA'),
 (6, 'Paula', 34, 'AWS/DEVOPS'),
 (6, 'Paula', 34, 'AWS/DEVOPS'),
 (7, 'Issak', 24, 'FULLSTACK'),
 (7, 'Issak', 24, 'FULLSTACK'),
 (8, 'Danny', 34, 'AWS/DEVOPS'),
 (8, 'Danny', 34, 'AWS/DEVOPS'),
 (9, 'Rudolf', None, None),
 (10, 'Jems', None, None)]

In [52]:
res=cur.execute('select students.name,students.roll_no,course.courseid,course.cname from course left join students on students.courseid=course.courseid')
res.fetchall()

[('Alana', 1, 75, 'DataScience'),
 ('Sammy', 4, 75, 'DataScience'),
 ('Garima', 2, 12, 'DSA'),
 ('Kenny', 5, 12, 'DSA'),
 ('Travis', 3, 24, 'FULLSTACK'),
 ('Issak', 7, 24, 'FULLSTACK'),
 ('Paula', 6, 34, 'AWS/DEVOPS'),
 ('Danny', 8, 34, 'AWS/DEVOPS'),
 ('Alana', 1, 75, 'DataScience'),
 ('Sammy', 4, 75, 'DataScience'),
 ('Garima', 2, 12, 'DSA'),
 ('Kenny', 5, 12, 'DSA'),
 ('Travis', 3, 24, 'FULLSTACK'),
 ('Issak', 7, 24, 'FULLSTACK'),
 ('Paula', 6, 34, 'AWS/DEVOPS'),
 ('Danny', 8, 34, 'AWS/DEVOPS')]

sqlite3 doesn't support right join and full join

## MySQL

In [1]:
!pip install mysql

Collecting mysql
  Downloading mysql-0.0.3-py3-none-any.whl (1.2 kB)
Collecting mysqlclient
  Downloading mysqlclient-2.1.1-cp39-cp39-win_amd64.whl (178 kB)
     ------------------------------------ 178.5/178.5 kB 716.1 kB/s eta 0:00:00
Installing collected packages: mysqlclient, mysql
Successfully installed mysql-0.0.3 mysqlclient-2.1.1

In [8]:
import mysql.connector

ModuleNotFoundError: No module named 'mysql'

In [9]:
db=mysql.connector.connect(
    host="localhost",
    user="adyasharout",
    password="AdyashaRout@08"
)
print(db)

NameError: name 'mysql' is not defined